AUTO_config_TK_pesok/src/Catalogs/ПортативныеУстройстваВвода/ПортативныеУстройстваВвода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПортативныеУстройстваВвода</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение компании, к которому относится склад компании</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Агент</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НЕ_Резервировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Администратор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <comment>Сотрудник, заключивший сделку с контрагентом</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаЗаказаУпаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/ПортативныеУстройстваВвода/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ЗаполнитьНоменклатуруНаСервере(ВыбЗнач)
	  Справочники.ПортативныеУстройстваВвода.ЗаполнитьТоварыПоУстройству(ВыбЗнач,Объект.Товары);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрагентовНаСервере(ВыбЗнач)
	  Справочники.ПортативныеУстройстваВвода.ЗаполнитьКонтрагентовПоУстройству(ВыбЗнач,Объект.Контрагенты);
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьНоменклатуру(Команда)
	Перем ВыбЗнач;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВвода",ЭтотОбъект,"Номенклатура");
	ПоказатьВводЗначения(Оповещение,ВыбЗнач,"Введите устройство",Тип("СправочникСсылка.ПортативныеУстройстваВвода"));

КонецПроцедуры

&НаКлиенте
Процедура ПослеВвода(ВыбЗнач,Параметр)Экспорт
	
	Если ВыбЗнач<>Неопределено Тогда
		Если Параметр = "Номенклатура" Тогда
			ЗаполнитьНоменклатуруНаСервере(ВыбЗнач);
		ИначеЕсли Параметр = "Контрагент" Тогда
			 ЗаполнитьКонтрагентовНаСервере(ВыбЗнач);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьКонтрагентов(Команда)
	Перем ВыбЗнач;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВвода",ЭтотОбъект,"Контрагент");
	ПоказатьВводЗначения(Оповещение,ВыбЗнач,"Введите устройство",Тип("СправочникСсылка.ПортативныеУстройстваВвода"));

КонецПроцедуры

&НаКлиенте
Процедура УдалитьКонтрагентовПоИндексуСтроки(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки",ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", "Номер строки с новой строки", 0, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтроки(тСтрока, Параметры) Экспорт
	Если НЕ тСтрока = Неопределено Тогда
		ВсегоСтрок = СтрЧислоСтрок(тСтрока);
		счн = ВсегоСтрок; 
		Для ст = 1 по ВсегоСтрок Цикл 
			
			Попытка
				инд = Число(СтрПолучитьСтроку(тСтрока, счн));
			Исключение
				счн = счн-1;
				Продолжить;
			КонецПопытки;
			
			Объект.Контрагенты.Удалить(инд-1);
			счн = счн-1;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры;
